app/helpers/members_helper.rb

SELECT "teams"."name", "teams"."id" FROM "teams"
---
  def teams
    Team.pluck(:name, :id)