app/helpers/projects_helper.rb

SELECT "members"."first_name", "members"."id" FROM "members"
---
  def members
    Member.pluck(:first_name, :id)