app/controllers/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @members = Member.all

INSERT INTO "members" ("first_name", "last_name", "city", "state", "country", "created_at", "updated_at", "team_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @member = Member.new(member_params)
    if @member.save

UPDATE "members" SET "updated_at" = ?, "team_id" = ? WHERE "members"."id" = ?  [["updated_at", "2022-05-09 13:43:33.772451"], ["team_id", 3], ["id", 1]]
---
  def update
    if @member.update(member_params)

SELECT "members".* FROM "members" WHERE "members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_member
    @member = Member.find(params[:id])