app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Instagram"], ["created_at", "2022-05-09 14:58:27.978245"], ["updated_at", "2022-05-09 14:58:27.978245"]]
---
  def create
    @project = Project.new(project_params)
    if @project.save

INSERT INTO "member_projects" ("member_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["member_id", 3], ["project_id", 1], ["created_at", "2022-05-10 07:59:18.636090"], ["updated_at", "2022-05-10 07:59:18.636090"]]
---
  def update
    if @project.update(project_params)
      @project.member_projects.create(member_id: params[:project][:member_id])

DELETE FROM "projects" WHERE "projects"."id" = ?  [["id", 2]]
---
  def destroy
    if @project.destroy