app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT "teams".* FROM "teams"

  def create
    @team = Team.new(team_params)
    if @team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rails "], ["created_at", "2022-05-09 09:56:31.424872"], ["updated_at", "2022-05-09 09:56:31.424872"]]

  def update
    if @team.update(team_params)
---
UPDATE "teams" SET "name" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["name", "Ruby On rails"], ["updated_at", "2022-05-09 13:50:28.674187"], ["id", 3]]

  def destroy
    if @team.destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]

  def set_team
    @team = Team.find(params[:id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]